_posts/2018-11-05-Using-autograd-for-error-propagation.html
---
title: Using autograd for error propagation
date: 2018/11/05 21:04:21
updated: 2018/11/05 21:04:21
categories: autograd,uncertainty
tags: 
---


<p>
Back in <a href="http://kitchingroup.cheme.cmu.edu/blog/2013/03/07/Another-approach-to-error-propagation/">2013</a> I wrote about using the uncertainties package to propagate uncertainties. The problem setup was for finding the uncertainty in the exit concentration from a CSTR when there are uncertainties in the other parameters. In this problem we were given this information about the parameters and their uncertainties.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parameter</th>
<th scope="col" class="org-right">value</th>
<th scope="col" class="org-right">&sigma;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Fa0</td>
<td class="org-right">5</td>
<td class="org-right">0.05</td>
</tr>

<tr>
<td class="org-left">v0</td>
<td class="org-right">10</td>
<td class="org-right">0.1</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-right">66000</td>
<td class="org-right">100</td>
</tr>

<tr>
<td class="org-left">k</td>
<td class="org-right">3</td>
<td class="org-right">0.2</td>
</tr>
</tbody>
</table>

<p>
The exit concentration is found by solving this equation:
</p>

<p>
\(0 = Fa0 - v0 * Ca - k * Ca**2 * V\)
</p>

<p>
So the question was what is Ca, and what is the uncertainty on it? Finding Ca is easy with fsolve.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">from</span> scipy.optimize <span style="color: #0000FF;">import</span> fsolve

<span style="color: #BA36A5;">Fa0</span> = 5.0
<span style="color: #BA36A5;">v0</span> = 10.0

<span style="color: #BA36A5;">V</span> = 66000.0
<span style="color: #BA36A5;">k</span> = 3.0

<span style="color: #0000FF;">def</span> <span style="color: #006699;">func</span>(Ca, v0, k, Fa0, V):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #036A07;">"Mole balance for a CSTR. Solve this equation for func(Ca)=0"</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">Fa</span> = v0 * Ca     <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">exit molar flow of A</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">ra</span> = -k * Ca**2  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">rate of reaction of A L/mol/h</span>
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">return</span> Fa0 - Fa + V * ra

Ca, = fsolve(func, 0.1 * Fa0 / v0, args=(v0, k, Fa0, V))
Ca
</pre>
</div>

<pre class="example">
0.0050000000000000001

</pre>

<p>
The uncertainty on Ca is a little trickier. A <a href="https://en.wikipedia.org/wiki/Propagation_of_uncertainty#Simplification">simplified</a> way to estimate it is:
</p>

<p>
\(\sigma_{Ca} = \sqrt{(dCa/dv0)^2 \sigma_{v0}^2 + (dCa/dv0)^2 \sigma_{v0}^2 + (dCa/dFa0)^2 \sigma_{Fa0}^2 + (dCa/dV)^2 \sigma_{V}^2}\)
</p>

<p>
We know the &sigma;_i for each input, we just need those partial derivatives. However, we only have the implicit function we used to solve for Ca, and I do not want to do the algebra to solve for Ca. Luckily, we <a href="http://kitchingroup.cheme.cmu.edu/blog/2018/10/08/Getting-derivatives-from-implicit-functions-with-autograd/">previously worked out</a> how to get these derivatives from an implicit function using autograd. We just need to loop through the arguments, get the relevant derivatives, and accumulate the product of the squared derivatives and errors. Finally, take the square root of that sum.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #0000FF;">import</span> autograd.numpy <span style="color: #0000FF;">as</span> np
<span style="color: #0000FF;">from</span> autograd <span style="color: #0000FF;">import</span> grad

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">these are the uncertainties on the inputs</span>
<span style="color: #BA36A5;">s</span> = [<span style="color: #D0372D;">None</span>, 0.1, 0.2, 0.05, 100]

<span style="color: #BA36A5;">S2</span> = 0.0

<span style="color: #BA36A5;">dfdCa</span> = grad(func, 0)
<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(1, 5):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">dfdarg2</span> = grad(func, i)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">dCadarg2</span> = -dfdarg2(Ca, v0, k, Fa0, V) / dfdCa(Ca, v0, k, Fa0, V)
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">S2</span> += dCadarg2**2 * s[i]**2

<span style="color: #BA36A5;">Ca_s</span> = np.sqrt(S2)
<span style="color: #0000FF;">print</span>(f<span style="color: #008000;">'Ca = {Ca:1.5f} +\- {Ca_s}'</span>)
</pre>
</div>

<pre class="example">
Ca = 0.00500 +\- 0.00016776432898276802


</pre>

<p>
That is the same uncertainty estimate the quantities package provided. One benefit here is I did not have to do the somewhat complicated wrapping procedure around fsolve that was required with uncertainties to get this. On the other hand, I did have to derive the formula and implement them. It worked fine here, since we have an implicit function and a way to get the required derivatives. It could take some work to do this with the exit concentration of a PFR, which requires an integrator. Maybe that <a href="http://kitchingroup.cheme.cmu.edu/blog/2018/10/11/A-differentiable-ODE-integrator-for-sensitivity-analysis/">differentiable integrator</a> will come in handy again!
</p>
<p>Copyright (C) 2018 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2018/11/05/Using-autograd-for-error-propagation.org">org-mode source</a></p>
<p>Org-mode version = 9.1.14</p>